; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: warehouse (Fully Documented Standard Version)
;;
;; Purpose:
;; This domain models a warehouse picking system where:
;;   - Workers execute commands (orders)
;;   - Products must be picked by type and location
;;   - Zone-based scanning controls workflow progression
;;   - Each order must pass per-type checkpoints before completion
;;
;; Workflow:
;;   Start Mission → Print Label → Move → Scan Zone →
;;   Pick Items → Verify Checkpoints → Finalize Order
;;
;; Key Concepts:
;;   - Commands represent customer orders
;;   - Products are assigned and picked per order
;;   - Each product type requires zone validation
;;   - Workers must not move with open picking zones
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)

    (:requirements
        :strips
        :typing
        :negative-preconditions
        :universal-preconditions
        :quantified-preconditions
        :disjunctive-preconditions
    )

    (:types
        product
        product-type
        command
        worker
        location
    )

    (:predicates

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; WORKER LOCATION AND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (at ?w - worker ?l - location)                 ;; Worker position in warehouse
        (free ?w - worker)                             ;; Worker is not assigned to a command
        (working-on ?w - worker ?c - command)          ;; Worker is actively executing a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND STATE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (mission-started ?c - command)                 ;; Command has been activated
        (command-complete ?c - command)                ;; Command fully completed

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; INVENTORY AND ASSIGNMENT
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (in-inventory ?p - product)                    ;; Product is still available in stock
        (assigned ?p - product ?c - command)           ;; Product assigned to a command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; LOCATION STRUCTURE
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (start-loc ?l - location)                      ;; Starting/control location for workers
        (type-zone ?t - product-type ?l - location)    ;; Location corresponds to product-type zone

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; PRODUCT INFORMATION
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (is-type ?p - product ?t - product-type)       ;; Product belongs to a type
        (at-loc ?p - product ?l - location)            ;; Product is physically at a location

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; COMMAND REQUIREMENTS
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (requires-type ?c - command ?t - product-type) ;; Order requires product type
        (required-product ?c - command ?p - product)    ;; Specific product required by command

        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
        ;; ZONE CONTROL / WORKFLOW TRACKING
        ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

        (zone-open ?w - worker ?c - command ?t - product-type)
                                                      ;; Worker has an active picking session for a type

        (checkpoint-verified ?t - product-type ?c - command)
                                                      ;; All required checks completed for a type

        (order-label-printed ?c - command)             ;; Order label has been printed
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: New-mission-PDA-and-print-order-label
    ;;
    ;; Purpose:
    ;;     Initialize a command and assign it to a worker.
    ;;
    ;; Preconditions:
    ;;     - Worker must be free
    ;;     - Worker must be at a start location
    ;;     - Command must not already be started
    ;;
    ;; Effects:
    ;;     - Worker becomes assigned to command
    ;;     - Command is marked as started
    ;;     - Worker is no longer free
    ;;
    ;; Workflow Stage:
    ;;     Mission initialization / dispatch
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action New-mission-PDA-and-print-order-label

        :parameters (?w - worker ?c - command ?l - location)

        :precondition
        (and
            (free ?w)
            (at ?w ?l)
            (start-loc ?l)
            (not (mission-started ?c))
        )

        :effect
        (and
            (not (free ?w))
            (working-on ?w ?c)
            (mission-started ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Print-order-label
    ;;
    ;; Purpose:
    ;;     Generate and attach order label for tracking.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - Label has not yet been printed
    ;;
    ;; Effects:
    ;;     - Order label becomes available
    ;;
    ;; Workflow Stage:
    ;;     Order preparation / identification
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Print-order-label

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)
            (not (order-label-printed ?c))
        )

        :effect
        (order-label-printed ?c)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: move
    ;;
    ;; Purpose:
    ;;     Move worker between locations while ensuring safe workflow.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to a command
    ;;     - Worker is at origin location
    ;;     - No active zone sessions exist
    ;;
    ;; Effects:
    ;;     - Worker changes location
    ;;
    ;; Constraint:
    ;;     - Worker cannot leave a zone while a picking session is open
    ;;
    ;; Workflow Stage:
    ;;     Navigation / warehouse traversal
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action move

        :parameters (?w - worker ?c - command ?from - location ?to - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?from)

            ;; ensure no open zone sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (not (at ?w ?from))
            (at ?w ?to)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-item-type
    ;;
    ;; Purpose:
    ;;     Open a picking session for a product type in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone location
    ;;     - Location corresponds to product type zone
    ;;     - No existing open session for this type
    ;;
    ;; Effects:
    ;;     - Zone session becomes active
    ;;
    ;; Workflow Stage:
    ;;     Zone validation / picking setup
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-item-type

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (not (zone-open ?w ?c ?t))
        )

        :effect
        (zone-open ?w ?c ?t)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: add-to-order
    ;;
    ;; Purpose:
    ;;     Pick a product and assign it to a command.
    ;;
    ;; Preconditions:
    ;;     - Worker is in active picking session
    ;;     - Product is at worker location
    ;;     - Product matches required type
    ;;     - Product is still in inventory
    ;;
    ;; Effects:
    ;;     - Product is removed from inventory
    ;;     - Product is assigned to command
    ;;
    ;; Workflow Stage:
    ;;     Picking / order fulfillment
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action add-to-order

        :parameters (?w - worker ?c - command ?p - product ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (at-loc ?p ?l)
            (is-type ?p ?t)
            (zone-open ?w ?c ?t)
            (in-inventory ?p)
        )

        :effect
        (and
            (not (in-inventory ?p))
            (assigned ?p ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: Scan-order-label
    ;;
    ;; Purpose:
    ;;     Verify completion of all required products in a zone.
    ;;
    ;; Preconditions:
    ;;     - Worker is in correct zone
    ;;     - Zone session is active
    ;;     - All required products are assigned
    ;;
    ;; Effects:
    ;;     - Zone is marked as completed
    ;;     - Picking session is closed
    ;;
    ;; Workflow Stage:
    ;;     Checkpoint validation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action Scan-order-label

        :parameters (?w - worker ?c - command ?t - product-type ?l - location)

        :precondition
        (and
            (working-on ?w ?c)
            (at ?w ?l)
            (type-zone ?t ?l)
            (zone-open ?w ?c ?t)

            ;; ensure all required products are assigned
            (forall (?p - product)
                (imply
                    (required-product ?c ?p)
                    (assigned ?p ?c)
                )
            )
        )

        :effect
        (and
            (not (zone-open ?w ?c ?t))
            (checkpoint-verified ?t ?c)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone
    ;;
    ;; Purpose:
    ;;     Finalize a command after all zones are validated.
    ;;
    ;; Preconditions:
    ;;     - Worker is assigned to command
    ;;     - All required product-type checkpoints are verified
    ;;     - No zone sessions are open
    ;;
    ;; Effects:
    ;;     - Worker becomes free
    ;;     - Command is completed
    ;;
    ;; Workflow Stage:
    ;;     Order completion / checkout
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone

        :parameters (?w - worker ?c - command)

        :precondition
        (and
            (working-on ?w ?c)

            ;; all required types checked
            (forall (?t - product-type)
                (imply
                    (requires-type ?c ?t)
                    (checkpoint-verified ?t ?c)
                )
            )

            ;; no active picking sessions
            (forall (?t - product-type)
                (not (zone-open ?w ?c ?t))
            )
        )

        :effect
        (and
            (free ?w)
            (not (working-on ?w ?c))
            (command-complete ?c)
        )
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: warehouse-two-workers-48-products
;;
;; Purpose:
;;   This large-scale warehouse scenario models:
;;     - Two workers executing parallel order fulfillment
;;     - 48 products split evenly across two commands
;;     - Strict type-based zone constraints
;;     - Full assignment verification for correctness
;;
;; Core Idea:
;;   - cmd1 handles first half of products (a1–a12, b1–b12)
;;   - cmd2 handles second half (a13–a24, b13–b24)
;;   - Ensures balanced workload across workers
;;
;; Goal:
;;   - Both commands must be fully completed
;;   - Every product must be explicitly assigned
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem warehouse-two-workers-48-products)

(:domain warehouse)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; OBJECTS
;;
;; Purpose:
;;   Defines all entities in the warehouse:
;;     - Workers performing tasks
;;     - Commands representing orders
;;     - Product types defining classification rules
;;     - Locations defining warehouse zones
;;     - Products to be picked and assigned
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:objects

    ;; ==========================
    ;; WORKERS
    ;; ==========================

    worker1 worker2 - worker

    ;; ==========================
    ;; COMMANDS
    ;; ==========================

    cmd1 cmd2 - command

    ;; ==========================
    ;; PRODUCT TYPES
    ;; ==========================

    typeA typeB - product-type

    ;; ==========================
    ;; LOCATIONS
    ;; ==========================

    locStart locA locB - location

    ;; ==========================
    ;; PRODUCTS (TYPE A)
    ;; ==========================

    a1 a2 a3 a4 a5 a6 a7 a8 a9 a10 a11 a12
    a13 a14 a15 a16 a17 a18 a19 a20 a21 a22 a23 a24 - product

    ;; ==========================
    ;; PRODUCTS (TYPE B)
    ;; ==========================

    b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12
    b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 - product

)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; INITIAL STATE
;;
;; Purpose:
;;   Defines the starting conditions:
;;     - Worker positions and availability
;;     - Warehouse zoning configuration
;;     - Product classification and placement
;;     - Inventory availability
;;     - Command requirements
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:init

    ;; ==========================
    ;; WORKER STATE
    ;; ==========================

    (free worker1)
    (free worker2)

    (at worker1 locStart)
    (at worker2 locStart)

    ;; ==========================
    ;; START LOCATION
    ;; ==========================

    (start-loc locStart)

    ;; ==========================
    ;; ZONE CONFIGURATION
    ;; ==========================

    (type-zone typeA locA)
    (type-zone typeB locB)

    ;; ==========================
    ;; PRODUCT CLASSIFICATION
    ;; ==========================

    ;; Type A products
    (is-type a1 typeA)
    (is-type a2 typeA)
    (is-type a3 typeA)
    (is-type a4 typeA)
    (is-type a5 typeA)
    (is-type a6 typeA)
    (is-type a7 typeA)
    (is-type a8 typeA)
    (is-type a9 typeA)
    (is-type a10 typeA)
    (is-type a11 typeA)
    (is-type a12 typeA)
    (is-type a13 typeA)
    (is-type a14 typeA)
    (is-type a15 typeA)
    (is-type a16 typeA)
    (is-type a17 typeA)
    (is-type a18 typeA)
    (is-type a19 typeA)
    (is-type a20 typeA)
    (is-type a21 typeA)
    (is-type a22 typeA)
    (is-type a23 typeA)
    (is-type a24 typeA)

    ;; Type B products
    (is-type b1 typeB)
    (is-type b2 typeB)
    (is-type b3 typeB)
    (is-type b4 typeB)
    (is-type b5 typeB)
    (is-type b6 typeB)
    (is-type b7 typeB)
    (is-type b8 typeB)
    (is-type b9 typeB)
    (is-type b10 typeB)
    (is-type b11 typeB)
    (is-type b12 typeB)
    (is-type b13 typeB)
    (is-type b14 typeB)
    (is-type b15 typeB)
    (is-type b16 typeB)
    (is-type b17 typeB)
    (is-type b18 typeB)
    (is-type b19 typeB)
    (is-type b20 typeB)
    (is-type b21 typeB)
    (is-type b22 typeB)
    (is-type b23 typeB)
    (is-type b24 typeB)

    ;; ==========================
    ;; PRODUCT LOCATIONS
    ;; ==========================

    ;; All Type A products in Zone A
    (at-loc a1 locA)  (at-loc a2 locA)  (at-loc a3 locA)  (at-loc a4 locA)
    (at-loc a5 locA)  (at-loc a6 locA)  (at-loc a7 locA)  (at-loc a8 locA)
    (at-loc a9 locA)  (at-loc a10 locA) (at-loc a11 locA) (at-loc a12 locA)
    (at-loc a13 locA) (at-loc a14 locA) (at-loc a15 locA) (at-loc a16 locA)
    (at-loc a17 locA) (at-loc a18 locA) (at-loc a19 locA) (at-loc a20 locA)
    (at-loc a21 locA) (at-loc a22 locA) (at-loc a23 locA) (at-loc a24 locA)

    ;; All Type B products in Zone B
    (at-loc b1 locB)  (at-loc b2 locB)  (at-loc b3 locB)  (at-loc b4 locB)
    (at-loc b5 locB)  (at-loc b6 locB)  (at-loc b7 locB)  (at-loc b8 locB)
    (at-loc b9 locB)  (at-loc b10 locB) (at-loc b11 locB) (at-loc b12 locB)
    (at-loc b13 locB) (at-loc b14 locB) (at-loc b15 locB) (at-loc b16 locB)
    (at-loc b17 locB) (at-loc b18 locB) (at-loc b19 locB) (at-loc b20 locB)
    (at-loc b21 locB) (at-loc b22 locB) (at-loc b23 locB) (at-loc b24 locB)

    ;; ==========================
    ;; INVENTORY STATE
    ;; ==========================

    ;; All products initially available in stock
    (in-inventory a1)  (in-inventory a2)  (in-inventory a3)  (in-inventory a4)
    (in-inventory a5)  (in-inventory a6)  (in-inventory a7)  (in-inventory a8)
    (in-inventory a9)  (in-inventory a10) (in-inventory a11) (in-inventory a12)
    (in-inventory a13) (in-inventory a14) (in-inventory a15) (in-inventory a16)
    (in-inventory a17) (in-inventory a18) (in-inventory a19) (in-inventory a20)
    (in-inventory a21) (in-inventory a22) (in-inventory a23) (in-inventory a24)

    (in-inventory b1)  (in-inventory b2)  (in-inventory b3)  (in-inventory b4)
    (in-inventory b5)  (in-inventory b6)  (in-inventory b7)  (in-inventory b8)
    (in-inventory b9)  (in-inventory b10) (in-inventory b11) (in-inventory b12)
    (in-inventory b13) (in-inventory b14) (in-inventory b15) (in-inventory b16)
    (in-inventory b17) (in-inventory b18) (in-inventory b19) (in-inventory b20)
    (in-inventory b21) (in-inventory b22) (in-inventory b23) (in-inventory b24)

    ;; ==========================
    ;; COMMAND REQUIREMENTS
    ;; ==========================

    ;; cmd1 requires both types (A and B)
    (requires-type cmd1 typeA)
    (requires-type cmd1 typeB)

    ;; cmd2 also requires both types (A and B)
    (requires-type cmd2 typeA)
    (requires-type cmd2 typeB)

)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; GOAL STATE
;;
;; Purpose:
;;   Ensures full execution correctness:
;;     - Both commands must be completed
;;     - All products must be explicitly assigned
;;     - Prevents shortcut solutions without real picking
;;
;; Structure:
;;   - Completion conditions
;;   - Explicit assignment verification
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:goal
(and

    ;; ==========================
    ;; COMPLETION CONDITIONS
    ;; ==========================

    (command-complete cmd1)
    (command-complete cmd2)

    ;; ==========================
    ;; CMD1 ASSIGNMENTS
    ;; ==========================

    (assigned a1 cmd1) (assigned a2 cmd1) (assigned a3 cmd1) (assigned a4 cmd1)
    (assigned a5 cmd1) (assigned a6 cmd1) (assigned a7 cmd1) (assigned a8 cmd1)
    (assigned a9 cmd1) (assigned a10 cmd1) (assigned a11 cmd1) (assigned a12 cmd1)

    (assigned b1 cmd1) (assigned b2 cmd1) (assigned b3 cmd1) (assigned b4 cmd1)
    (assigned b5 cmd1) (assigned b6 cmd1) (assigned b7 cmd1) (assigned b8 cmd1)
    (assigned b9 cmd1) (assigned b10 cmd1) (assigned b11 cmd1) (assigned b12 cmd1)

    ;; ==========================
    ;; CMD2 ASSIGNMENTS
    ;; ==========================

    (assigned a13 cmd2) (assigned a14 cmd2) (assigned a15 cmd2) (assigned a16 cmd2)
    (assigned a17 cmd2) (assigned a18 cmd2) (assigned a19 cmd2) (assigned a20 cmd2)
    (assigned a21 cmd2) (assigned a22 cmd2) (assigned a23 cmd2) (assigned a24 cmd2)

    (assigned b13 cmd2) (assigned b14 cmd2) (assigned b15 cmd2) (assigned b16 cmd2)
    (assigned b17 cmd2) (assigned b18 cmd2) (assigned b19 cmd2) (assigned b20 cmd2)
    (assigned b21 cmd2) (assigned b22 cmd2) (assigned b23 cmd2) (assigned b24 cmd2)

)

)

)

; plan
1. (new-mission-pda-and-print-order-label worker2 cmd2 locstart)
   deleted: (free worker2)
   added: (working-on worker2 cmd2) (mission-started cmd2)
   goals met: 0 of 50
2. (new-mission-pda-and-print-order-label worker1 cmd1 locstart)
   deleted: (free worker1)
   added: (working-on worker1 cmd1) (mission-started cmd1)
   goals met: 0 of 50
3. (move worker2 cmd2 locstart locb)
   deleted: (at worker2 locstart)
   added: (at worker2 locb)
   goals met: 0 of 50
4. (move worker1 cmd1 locstart locb)
   deleted: (at worker1 locstart)
   added: (at worker1 locb)
   goals met: 0 of 50
5. (scan-item-type worker2 cmd2 typeb locb)
   added: (zone-open worker2 cmd2 typeb)
   goals met: 0 of 50
6. (scan-item-type worker1 cmd1 typeb locb)
   added: (zone-open worker1 cmd1 typeb)
   goals met: 0 of 50
7. (add-to-order worker2 cmd2 b13 typeb locb)
   deleted: (in-inventory b13)
   added: (assigned b13 cmd2)
   goals met: 1 of 50
8. (add-to-order worker2 cmd2 b14 typeb locb)
   deleted: (in-inventory b14)
   added: (assigned b14 cmd2)
   goals met: 2 of 50
9. (add-to-order worker2 cmd2 b15 typeb locb)
   deleted: (in-inventory b15)
   added: (assigned b15 cmd2)
   goals met: 3 of 50
10. (add-to-order worker2 cmd2 b16 typeb locb)
   deleted: (in-inventory b16)
   added: (assigned b16 cmd2)
   goals met: 4 of 50
11. (add-to-order worker2 cmd2 b17 typeb locb)
   deleted: (in-inventory b17)
   added: (assigned b17 cmd2)
   goals met: 5 of 50
12. (add-to-order worker2 cmd2 b18 typeb locb)
   deleted: (in-inventory b18)
   added: (assigned b18 cmd2)
   goals met: 6 of 50
13. (add-to-order worker2 cmd2 b19 typeb locb)
   deleted: (in-inventory b19)
   added: (assigned b19 cmd2)
   goals met: 7 of 50
14. (add-to-order worker2 cmd2 b20 typeb locb)
   deleted: (in-inventory b20)
   added: (assigned b20 cmd2)
   goals met: 8 of 50
15. (add-to-order worker2 cmd2 b21 typeb locb)
   deleted: (in-inventory b21)
   added: (assigned b21 cmd2)
   goals met: 9 of 50
16. (add-to-order worker2 cmd2 b22 typeb locb)
   deleted: (in-inventory b22)
   added: (assigned b22 cmd2)
   goals met: 10 of 50
17. (add-to-order worker2 cmd2 b23 typeb locb)
   deleted: (in-inventory b23)
   added: (assigned b23 cmd2)
   goals met: 11 of 50
18. (add-to-order worker2 cmd2 b24 typeb locb)
   deleted: (in-inventory b24)
   added: (assigned b24 cmd2)
   goals met: 12 of 50
19. (add-to-order worker1 cmd1 b1 typeb locb)
   deleted: (in-inventory b1)
   added: (assigned b1 cmd1)
   goals met: 13 of 50
20. (add-to-order worker1 cmd1 b2 typeb locb)
   deleted: (in-inventory b2)
   added: (assigned b2 cmd1)
   goals met: 14 of 50
21. (add-to-order worker1 cmd1 b3 typeb locb)
   deleted: (in-inventory b3)
   added: (assigned b3 cmd1)
   goals met: 15 of 50
22. (add-to-order worker1 cmd1 b4 typeb locb)
   deleted: (in-inventory b4)
   added: (assigned b4 cmd1)
   goals met: 16 of 50
23. (add-to-order worker1 cmd1 b5 typeb locb)
   deleted: (in-inventory b5)
   added: (assigned b5 cmd1)
   goals met: 17 of 50
24. (add-to-order worker1 cmd1 b6 typeb locb)
   deleted: (in-inventory b6)
   added: (assigned b6 cmd1)
   goals met: 18 of 50
25. (add-to-order worker1 cmd1 b7 typeb locb)
   deleted: (in-inventory b7)
   added: (assigned b7 cmd1)
   goals met: 19 of 50
26. (add-to-order worker1 cmd1 b8 typeb locb)
   deleted: (in-inventory b8)
   added: (assigned b8 cmd1)
   goals met: 20 of 50
27. (add-to-order worker1 cmd1 b9 typeb locb)
   deleted: (in-inventory b9)
   added: (assigned b9 cmd1)
   goals met: 21 of 50
28. (add-to-order worker1 cmd1 b10 typeb locb)
   deleted: (in-inventory b10)
   added: (assigned b10 cmd1)
   goals met: 22 of 50
29. (add-to-order worker1 cmd1 b11 typeb locb)
   deleted: (in-inventory b11)
   added: (assigned b11 cmd1)
   goals met: 23 of 50
30. (add-to-order worker1 cmd1 b12 typeb locb)
   deleted: (in-inventory b12)
   added: (assigned b12 cmd1)
   goals met: 24 of 50
31. (scan-order-label worker2 cmd2 typeb locb)
   deleted: (zone-open worker2 cmd2 typeb)
   added: (checkpoint-verified typeb cmd2)
   goals met: 24 of 50
32. (scan-order-label worker1 cmd1 typeb locb)
   deleted: (zone-open worker1 cmd1 typeb)
   added: (checkpoint-verified typeb cmd1)
   goals met: 24 of 50
33. (move worker2 cmd2 locb loca)
   deleted: (at worker2 locb)
   added: (at worker2 loca)
   goals met: 24 of 50
34. (move worker1 cmd1 locb loca)
   deleted: (at worker1 locb)
   added: (at worker1 loca)
   goals met: 24 of 50
35. (scan-item-type worker2 cmd2 typea loca)
   added: (zone-open worker2 cmd2 typea)
   goals met: 24 of 50
36. (scan-item-type worker1 cmd1 typea loca)
   added: (zone-open worker1 cmd1 typea)
   goals met: 24 of 50
37. (add-to-order worker2 cmd2 a13 typea loca)
   deleted: (in-inventory a13)
   added: (assigned a13 cmd2)
   goals met: 25 of 50
38. (add-to-order worker2 cmd2 a14 typea loca)
   deleted: (in-inventory a14)
   added: (assigned a14 cmd2)
   goals met: 26 of 50
39. (add-to-order worker2 cmd2 a15 typea loca)
   deleted: (in-inventory a15)
   added: (assigned a15 cmd2)
   goals met: 27 of 50
40. (add-to-order worker2 cmd2 a16 typea loca)
   deleted: (in-inventory a16)
   added: (assigned a16 cmd2)
   goals met: 28 of 50
41. (add-to-order worker2 cmd2 a17 typea loca)
   deleted: (in-inventory a17)
   added: (assigned a17 cmd2)
   goals met: 29 of 50
42. (add-to-order worker2 cmd2 a18 typea loca)
   deleted: (in-inventory a18)
   added: (assigned a18 cmd2)
   goals met: 30 of 50
43. (add-to-order worker2 cmd2 a19 typea loca)
   deleted: (in-inventory a19)
   added: (assigned a19 cmd2)
   goals met: 31 of 50
44. (add-to-order worker2 cmd2 a20 typea loca)
   deleted: (in-inventory a20)
   added: (assigned a20 cmd2)
   goals met: 32 of 50
45. (add-to-order worker2 cmd2 a21 typea loca)
   deleted: (in-inventory a21)
   added: (assigned a21 cmd2)
   goals met: 33 of 50
46. (add-to-order worker2 cmd2 a22 typea loca)
   deleted: (in-inventory a22)
   added: (assigned a22 cmd2)
   goals met: 34 of 50
47. (add-to-order worker2 cmd2 a23 typea loca)
   deleted: (in-inventory a23)
   added: (assigned a23 cmd2)
   goals met: 35 of 50
48. (add-to-order worker2 cmd2 a24 typea loca)
   deleted: (in-inventory a24)
   added: (assigned a24 cmd2)
   goals met: 36 of 50
49. (add-to-order worker1 cmd1 a1 typea loca)
   deleted: (in-inventory a1)
   added: (assigned a1 cmd1)
   goals met: 37 of 50
50. (add-to-order worker1 cmd1 a2 typea loca)
   deleted: (in-inventory a2)
   added: (assigned a2 cmd1)
   goals met: 38 of 50
51. (add-to-order worker1 cmd1 a3 typea loca)
   deleted: (in-inventory a3)
   added: (assigned a3 cmd1)
   goals met: 39 of 50
52. (add-to-order worker1 cmd1 a4 typea loca)
   deleted: (in-inventory a4)
   added: (assigned a4 cmd1)
   goals met: 40 of 50
53. (add-to-order worker1 cmd1 a5 typea loca)
   deleted: (in-inventory a5)
   added: (assigned a5 cmd1)
   goals met: 41 of 50
54. (add-to-order worker1 cmd1 a6 typea loca)
   deleted: (in-inventory a6)
   added: (assigned a6 cmd1)
   goals met: 42 of 50
55. (add-to-order worker1 cmd1 a7 typea loca)
   deleted: (in-inventory a7)
   added: (assigned a7 cmd1)
   goals met: 43 of 50
56. (add-to-order worker1 cmd1 a8 typea loca)
   deleted: (in-inventory a8)
   added: (assigned a8 cmd1)
   goals met: 44 of 50
57. (add-to-order worker1 cmd1 a9 typea loca)
   deleted: (in-inventory a9)
   added: (assigned a9 cmd1)
   goals met: 45 of 50
58. (add-to-order worker1 cmd1 a10 typea loca)
   deleted: (in-inventory a10)
   added: (assigned a10 cmd1)
   goals met: 46 of 50
59. (add-to-order worker1 cmd1 a11 typea loca)
   deleted: (in-inventory a11)
   added: (assigned a11 cmd1)
   goals met: 47 of 50
60. (add-to-order worker1 cmd1 a12 typea loca)
   deleted: (in-inventory a12)
   added: (assigned a12 cmd1)
   goals met: 48 of 50
61. (scan-order-label worker2 cmd2 typea loca)
   deleted: (zone-open worker2 cmd2 typea)
   added: (checkpoint-verified typea cmd2)
   goals met: 48 of 50
62. (scan-order-label worker1 cmd1 typea loca)
   deleted: (zone-open worker1 cmd1 typea)
   added: (checkpoint-verified typea cmd1)
   goals met: 48 of 50
63. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker2 cmd2)
   deleted: (working-on worker2 cmd2)
   added: (free worker2) (command-complete cmd2)
   goals met: 49 of 50
64. (finish-command-print-label-scan-finished-codebar-and-leave-in-controlzone worker1 cmd1)
   deleted: (working-on worker1 cmd1)
   added: (free worker1) (command-complete cmd1)
   goals met: 50 of 50
